Tekla Open API Reference for Tekla Structures 2025
Util Methods
The Localization.Util type exposes the following members.
Methods
Name | Description
LocalizeDataGridView
 Localizes a DataGridView.
LocalizeImageListComboBox
 Localizes an ImageListComboBox.
LocalizeListControl
 Localizes a List control.
LocalizeToolStrip
 Localizes a ToolStrip.
Top
See Also
Reference
Localization.Util Class
Tekla.Structures.Dialog Namespace